<?php include THORGATES_REQUIRE_DIRECTORY . '/template-parts/content-variables.php'; ?>
<section id="contacts" class="contacts">
    <div class="container">
        <div class="contacts__container">
            <div class="contacts__title">
                <h2><?= __('Давайте <strong> створимо</strong> щось <strong>неймовірне</strong> разом' , 'headgroup') ?></h2>
            </div>
            <div class="contacts__wrap">
                <div class="contacts__wrap__img">
                <img src="<?= THORGATES_THEME_DIRECTORY ?>assets/images/contact-img1.png" alt="Давайте створимощось неймовірнеразом">
                </div>
            <div class="contacts__form">
                <?= do_shortcode('[contact-form-7 id="aff037f" title="Контактная форма"]') ?>
               
                </form>
            </div>
            <div class="contacts__socials">
			    <?php if($contact_email) : ?>
                <div class="contacts__socials__mail">					
                <div><?= __('напишіть нам:' , 'headgroup') ?></div>
                <a href="mailto:<?= $contact_email ?>"><?= $contact_email ?></a>
            </div>
            <?php endif; ?>
            <div class="contacts__socials__wrap"> 
            <?php if($telegram) : ?>
            <a href="<?= $telegram ?>" target="_blank" rel="nofollow">
                <svg xmlns="http://www.w3.org/2000/svg" width="22" height="22" viewBox="0 0 22 22" fill="none">
                <g clip-path="url(#clip0_221_2698)">
                <path d="M19.7952 2.363L1.19018 9.57462C0.441482 9.91045 0.188252 10.583 1.00922 10.948L5.78221 12.4727L17.3227 5.30354C17.9528 4.85347 18.5979 4.97348 18.0428 5.46858L8.13109 14.4894L7.81974 18.3069C8.10812 18.8964 8.63616 18.8991 8.97298 18.6061L11.7152 15.998L16.4117 19.533C17.5025 20.1821 18.096 19.7632 18.3307 18.5735L21.4112 3.91163C21.7311 2.44717 21.1856 1.80191 19.7952 2.363Z" fill="#BAF67C"/>
                </g>
                <defs>
                <clipPath id="clip0_221_2698">
                <rect width="21" height="21" fill="white" transform="translate(0.5 0.5)"/>
                </clipPath>
                </defs>
                </svg>
            </a>
            <?php endif; ?>
            <?php if($instagram) : ?>
            <a href="<?= $instagram ?>" target="_blank" rel="nofollow">
                <svg xmlns="http://www.w3.org/2000/svg" width="22" height="22" viewBox="0 0 22 22" fill="none">
                <path d="M10.9987 1.83203C13.4893 1.83203 13.8 1.8412 14.7772 1.88703C15.7534 1.93286 16.418 2.08595 17.0029 2.31328C17.6079 2.54611 18.1175 2.86145 18.6272 3.3702C19.0933 3.82844 19.454 4.38274 19.6841 4.99453C19.9105 5.57845 20.0645 6.24395 20.1104 7.2202C20.1534 8.19736 20.1654 8.50811 20.1654 10.9987C20.1654 13.4893 20.1562 13.8 20.1104 14.7772C20.0645 15.7534 19.9105 16.418 19.6841 17.0029C19.4547 17.615 19.0939 18.1694 18.6272 18.6272C18.1688 19.0932 17.6146 19.4538 17.0029 19.6841C16.4189 19.9105 15.7534 20.0645 14.7772 20.1104C13.8 20.1534 13.4893 20.1654 10.9987 20.1654C8.50811 20.1654 8.19736 20.1562 7.2202 20.1104C6.24395 20.0645 5.57936 19.9105 4.99453 19.6841C4.3825 19.4545 3.8281 19.0937 3.3702 18.6272C2.90399 18.169 2.5433 17.6147 2.31328 17.0029C2.08595 16.4189 1.93286 15.7534 1.88703 14.7772C1.84395 13.8 1.83203 13.4893 1.83203 10.9987C1.83203 8.50811 1.8412 8.19736 1.88703 7.2202C1.93286 6.24303 2.08595 5.57936 2.31328 4.99453C2.54266 4.38236 2.90343 3.82791 3.3702 3.3702C3.82823 2.90383 4.38259 2.54312 4.99453 2.31328C5.57936 2.08595 6.24303 1.93286 7.2202 1.88703C8.19736 1.84395 8.50811 1.83203 10.9987 1.83203ZM10.9987 6.41536C9.78312 6.41536 8.61733 6.89825 7.75779 7.75779C6.89825 8.61733 6.41536 9.78312 6.41536 10.9987C6.41536 12.2143 6.89825 13.3801 7.75779 14.2396C8.61733 15.0991 9.78312 15.582 10.9987 15.582C12.2143 15.582 13.3801 15.0991 14.2396 14.2396C15.0991 13.3801 15.582 12.2143 15.582 10.9987C15.582 9.78312 15.0991 8.61733 14.2396 7.75779C13.3801 6.89825 12.2143 6.41536 10.9987 6.41536ZM16.957 6.1862C16.957 5.8823 16.8363 5.59086 16.6214 5.37597C16.4065 5.16109 16.1151 5.04036 15.8112 5.04036C15.5073 5.04036 15.2159 5.16109 15.001 5.37597C14.7861 5.59086 14.6654 5.8823 14.6654 6.1862C14.6654 6.49009 14.7861 6.78154 15.001 6.99642C15.2159 7.21131 15.5073 7.33203 15.8112 7.33203C16.1151 7.33203 16.4065 7.21131 16.6214 6.99642C16.8363 6.78154 16.957 6.49009 16.957 6.1862ZM10.9987 8.2487C11.728 8.2487 12.4275 8.53843 12.9432 9.05415C13.459 9.56988 13.7487 10.2694 13.7487 10.9987C13.7487 11.728 13.459 12.4275 12.9432 12.9432C12.4275 13.459 11.728 13.7487 10.9987 13.7487C10.2694 13.7487 9.56988 13.459 9.05415 12.9432C8.53843 12.4275 8.2487 11.728 8.2487 10.9987C8.2487 10.2694 8.53843 9.56988 9.05415 9.05415C9.56988 8.53843 10.2694 8.2487 10.9987 8.2487Z" fill="#BAF67C"/>
                </svg>
            </a>
            <?php endif ;?>
            </div>
            </div>
            </div>
        </div>
        <div class="popup" data-popup="popup-contact">
    <div class="popup-bg" data-close="close"></div>
        <div class="popup-wrapper">
            <div class="popup-wrap">
                <div class="popup__top">
                <div><?= __('Ваша заявка отримана!' , 'headgroup') ?></div>
                <p><?= __('<strong> Невдовзі ми з вами зв’яжемося</strong>, щоб розпочати роботу  над вашим проєктом.' , 'headgropup') ?></p>
                </div>
                <div class="popup__bottom">
                <button class="btn" data-close="close"><?= __('Ок, чекаю!' , 'headgroup') ?></button>
                </div>
            </div>
    </div>
</div>
    </div>
</section>
